
* Setup Elm environment

Basis is file =elm-package.json=.  It contains information about
dependencies within the Elm universe which is all about Elm packages.

#+begin_src shell
elm package install
#+end_src

This command might actually download some.

If there are no errors expect to have a directory =elm-stuff= which
contains the Elm-packages according to the specification in
=elm-package.json=.

* Build the Website

*** Given

 - Main.elm
 - index.html
 - style.css

*** Action for Output

***** Compile to js
:PROPERTIES:
:ID:       3eb40b22-3834-46fa-8b3a-eb8a1539d337
:END:

Go to shell!  You can evaluate

#+begin_src shell :results drawer
elm-make Main.elm --output elm.js
elm-make Main.elm --output main.html
#+end_src

#+RESULTS:
:RESULTS:
Success! Compiled 1 module.
Successfully generated elm.js
Success! Compiled 1 module.
Successfully generated main.html
:END:

Which is expected to yield file elm.js.  The latter shall be included
in some html-file.
